app/controllers/students_controller.rb

    def create
        @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ari"], ["last_name", "Mayer"], ["created_at", "2020-11-29 23:16:11.203147"], ["updated_at", "2020-11-29 23:16:11.203147"]]

    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Mayer!"], ["updated_at", "2020-11-29 23:16:20.027090"], ["id", 1]]